Repository: Polytechnique-org/diogenes
Catalog: po/*.po
Languages: fr

source: Welcome to Diogenes
fr: Bienvenue sur Diogenes

source: Welcome to the Diogenes content management system.
fr: Diogenes est un système permettant de créer des sites web et de les administrer à travers une interface web.

source: Diogenes was developed by the webmasters of the Polytechnique.org web site.
fr: Diogenes a été mis au point par l'équipe de Polytechnique.org.

source: The following barrels are currently available
fr: Les tonneaux suivants sont disponibles

source: Changing password..
fr: Changement de mot de passe...

source: User preferences
fr: Préférences

source: Diogenes preferences
fr: Préférences de Diogenes

source: my information
fr: mes informations

source: username
fr: utilisateur

source: full name
fr: identité

source: language
fr: langue

source: You can select your preferred language by clicking on the appropriate language below.
fr: Vous pouvez choisir votre langue préférée en cliquant sur la langue de votre choix ci-dessous.

source: my password
fr: mot de passe

source: new password
fr: nouveau mot de passe

source: Change
fr: Changer

source: Commiting changes to file
fr: Enregistrement des modifications

source: File editor
fr: Éditeur de fichier

source: File source
fr: Source du fichier

source: Submit
fr: Envoyer

source: pages catalog
fr: catalogue des pages

source: page properties
fr: propriétés de la page

source: view page
fr: voir la page

source: browse files
fr: parcourir les fichiers

source: raw editor
fr: éditeur brut

source: HTML editor
fr: éditeur HTML

source: file revisions
fr: versions du fichier

source: The site's menus
fr: Menus du site

source: The selected menu has child items, please remove them first.
fr: Le menu sélectionné a encore des menus fils, il faut d'abord les supprimer.

source: menu entry properties
fr: propriétés de l'entrée

source: none
fr: aucun

source: internal link
fr: lien interne

source: external link
fr: lien extérieur

source: move up
fr: remonter

source: move down
fr: descendre

source: edit
fr: éditer

source: delete
fr: supprimer

source: External links are denoted with the [ext] prefix.
fr: Les liens extérieurs sont signalés par le préfixe [ext].

source: Add new entry
fr: Ajouter une entrée

source: Error during file transfer!
fr: Erreur lors de l'envoi du fichier&nbsp;!

source: Deleting file
fr: Suppression du fichier

source: Revision differences
fr: Différences entre versions

source: File revisions
fr: Versions du fichier

source: File manager
fr: Gestionnaire de fichiers

source: Files in current directory
fr: Fichiers actuellement dans ce répertoire

source: Import file
fr: Importer un fichier

source: Send
fr: Envoyer

source: File to upload
fr: Fichier à envoyer

source: site created
fr: site créé

source: page created
fr: page créée

source: page deleted
fr: page supprimée

source: file updated
fr: mise à jour

source: file removed
fr: suppression du fichier

source: Welcome to the Diogenes backoffice
fr: Bienvenue sur l'interface d'administration

source: user
fr: utilisateur

source: event
fr: événement

source: Page manager
fr: Gestionnaire des pages

source: Reset
fr: R.À.Z.

source: Page properties
fr: Propriétés de la page

source: location
fr: emplacement

source: title
fr: titre

source: display
fr: affichage

source: access
fr: accès

source: Add a page
fr: Ajouter une page

source: Document name does not end in .doc
fr: Le nom du document ne se termine pas en .doc

source: Checking in Word file
fr: Enregistrement du fichier Word

source: Importing Word file
fr: Import du fichier Word

source: Importing HTML file
fr: Import du fichier HTML

source: Raw file import
fr: Import du fichier brut

source: view
fr: voir

source: properties
fr: propriétés

source: files
fr: fichiers

source: revisions
fr: versions

source: Import a Word document
fr: Importer un document Word

source: This page's master document is currently a Word document.
fr: Le document maître pour cette page est actuellement un fichier Word.

source: You can upload a new version of the Word document below.
fr: Vous pouvez envoyer une nouvelle version du fichier Word ci-dessous.

source: You can get the current version of the file here
fr: Vous pouvez récupérer la version actuelle du fichier ici

source: If you wish, you can set this page's content from a Word document.
fr: Si vous le souhaitez, vous pouvez remplacer le contenu de cette page par celui d'un fichier Word.

source: To do so, simply upload the Word document below.
fr: Pour ce faire, il vous suffit d'indiquer le fichier Word à importer ci-dessous.

source: You can replace the current page's contents by uploading an HTML file below.
fr: Vous pouvez remplacer le contenu de la page en important un fichier HTML ci-dessous.

source: If the file name ends with .htm or .html, anything outside the &lt;body&gt;&lt;/body&gt; pair will be stripped.
fr: Si le nom se termine par .htm ou .html, tout ce qui est en dehors des balises &lt;body&gt;&lt;/body&gt; sera retiré.

source: Could not find requested user
fr: L'utilisateur demandé n'a pas été trouvé

source: Users administration
fr: Gestion des utilisateurs

source: Registered users
fr: Utilisateurs du site

source: Administrators
fr: Administrateurs

source: remove
fr: retirer

source: Diogenes login
fr: Connexion à Diogenes

source: password
fr: mot de passe

source: You are not authorized to view this page!
fr: Vous n'êtes pas autorisé à consulter cette page&nbsp;!

source: Home
fr: Accueil

source: Logout
fr: D&eacute;connexion

source: Login
fr: Connexion

source: diff to
fr: diff. avec

source: restore
fr: restaurer

source: Admin manual
fr: Manuel d'administration

source: Settings
fr: Paramètres

source: Users
fr: Utilisateurs

source: Content
fr: Contenu

source: Pages catalog
fr: Catalogue des pages

source: Edit style sheet
fr: Éditer la feuille de style

source: Edit menu
fr: Éditer le menu

source: Toplevel administration
fr: Administration

source: Powered by Diogenes
fr: Fonctionne sous Diogenes

source: The requested document was not found.
fr: Le document demandé n'existe pas.

source: User manual
fr: Manuel de l'utilisateur

source: Preferences
fr: Préférences

source: Root manual
fr: Manuel du système

source: List of sites
fr: Liste des sites

source: Site administrators
fr: Administrateurs des sites

source: User accounts
fr: Comptes utilisateurs

source: Browse user log
fr: Afficher le journal

source: Logger actions
fr: Actions logger

source: Diogenes error
fr: Erreur de Diogenes

source: Error
fr: Erreur

source: view session
fr: afficher la session

source: user's log
fr: voir le journal

source: User activity log
fr: Journal des événements

source: view log
fr: voir le journal

source: administrator
fr: administrateur

source: site users
fr: utilisateurs du site

source: demote to user
fr: rétrograder

source: keywords
fr: mots clés

source: Create a new site
fr: Créer un nouveau site

source: vhost (see note)
fr: vhost (voir notice)

source: flags
fr: drapeaux

source: Activity
fr: Activité

source: first name
fr: prénom

source: last name
fr: nom

source: Directory not found
fr: Répertoire introuvable

source: read access
fr: accès en lecture

source: write access
fr: accès en écriture

source: world-writable pages are not allowed with PHP execution enabled!
fr: il n'est pas possible de rendre une page publiquement modifiable avec l'exécution PHP activée&nbsp;!

source: Edit this page
fr: Éditer cette page

source: Raw editor
fr: Éditeur brut

source: Convert
fr: Convertir

source: You are currently using RCS as the version control system for your barrels.
fr: Vous utilisez actuellement RCS pour gérer les versions de fichiers.

source: You can switch to a full CVS repository by clicking here.
fr: Vous pouvez passer à CVS en cliquant ici.

source: You are currently using CVS as the version control system for your barrels.
fr: Vous utilisez actuellement CVS pour gérer les versions de fichiers.

source: You can switch back to RCS by clicking here.
fr: Vous pouvez repasser à RCS en cliquant ici.

source: file
fr: fichier

source: author
fr: auteur

source: size
fr: taille

source: the page location cannot contain spaces or special characters
fr: l'emplacement de la page ne peut contenir ni espaces ni caractères spéciaux

source: this location cannot be used, it is reserved by Diogenes
fr: cet emplacement ne peut être utilisé, il est réservé par Diogenes

source: log
fr: journal

source: entry title
fr: titre de l'entrée

source: type of link
fr: type de lien

source: menu name
fr: nom du menu

source: link
fr: lien

source: Global options
fr: Options globales

source: menu options
fr: options des menus

source: menu style
fr: style du menu

source: menu theme
fr: thème du menu

source: version control system
fr: système de révision

source: Site options
fr: Options du site

source: fully expanded
fr: totalement déroulé

source: minimum menu levels to expand
fr: nombre minimum de niveaux à afficher

source: general options
fr: options générales

source: session properties
fr: propriétés de la session

source: host
fr: hôte

source: browser
fr: navigateur

source: data
fr: données

source: filter by
fr: filtrer par

source: start
fr: début

source: summary
fr: résumé

source: year
fr: année

source: month
fr: mois

source: day
fr: jour

source: create
fr: créer

source: new entry
fr: nouvelle entrée

source: existing entry
fr: entrée existante

source: (blank = no change)
fr: (vide = ne pas changer)

source: back
fr: retour

source: You are about to delete this entry. Do you want to proceed?
fr: Vous êtes sur le point de supprimer cette entrée. Souhaitez-vous continuer?

source: Authentication error!
fr: Erreur lors de l'authentification&nbsp;!

source: File
fr: Fichier

source: The site alias may only contain letters, numbers and underscores.
fr: L'alias du site ne peut contenir que des lettres, des chiffres et des tirets bas.

source: <b>vhost note</b>: If you intend to serve this site from a virtualhost, you should enter the name of the virtualhost in this field.
fr: <b>note sur vhost</b> : Si vous comptez héberger ce site sur un virtualhost, il vous faut saisir dans ce champs le nom du virtualhost.

source: PHP execution
fr: exécution PHP

source: custom templates
fr: templates personnalisées

source: template options
fr: options des templates

source: templates directory
fr: répertoire des templates

source: default template
fr: template par défaut

source: log message
fr: message pour le log

source: (relative url to a PNG image)
fr: (adresse relative de l'image PNG)

source: page template
fr: template de la page

source: status
fr: état

source: under construction
fr: en construction

source: disabled
fr: désactivée

source: archived
fr: archivée

source: This page is currently under construction.
fr: Cette page est actuellement en construction.

source: This page is currently unavailable.
fr: Cette page n'est pas disponible actuellement.

source: http://diogenes-doc.polytechnique.org/en-admin/
fr: http://diogenes-doc.polytechnique.org/fr-admin/

source: http://diogenes-doc.polytechnique.org/en-user/
fr: http://diogenes-doc.polytechnique.org/fr-user/

source: http://diogenes-doc.polytechnique.org/en-root/
fr: http://diogenes-doc.polytechnique.org/fr-root/

source: display options
fr: options d'affichage

source: system options
fr: options système

source: Initial user setup
fr: Paramétrage d'un utilisateur initial

source: Sorry, this feature is only available using native Diogenes authentication.
fr: Désolé, cette fonctionalité est disponible uniquement pour l'authentification native de Diogenes.

source: The database is already configured.
fr: La base de données est déjà configurée.

source: value
fr: valeur

source: debugging
fr: deboggage

source: call trace
fr: appels de fonctions

source: database trace
fr: appels base de données

source: all
fr: tous

source: Please select a year and/or a user.
fr: Veuillez sélectionner une année et/ou un utilisateur.

source: previous page
fr: page précédente

source: next page
fr: page suivante

source: Initial setup
fr: Paramétrage initial

source: The initial setup of the database was performed successfuly.
fr: Le paramétrage initial de la base de données a été effectué avec succès.

source: no
fr: non

source: yes
fr: oui

source: hide Diogenes menu
fr: cacher le menu Diogenes

source: account preferences
fr: préférences

source: Barrel plugins
fr: Plugins du tonneau

source: Global plugin settings
fr: Configuration globale des plugins

source: Rebuilding plugin cache for barrel '%s'
fr: Reconstruction du cache pour le tonneau '%s'

source: Clean plugins database
fr: Nettoyage de la base de données des plugins

source: If you are having problems with references to plugins that no longer exist, you can have Diogenes remove such entries from the database.
fr: Si vous rencontrez des problèmes de références à des plugins qui n'existent plus, vous pouvez demander à Diogenes de supprimer ces références dans la base de données.

source: Clean
fr: Nettoyer

source: Enable or disable plugins
fr: Active ou désactiver des plugins

source: You can select the plugins you want to enable for this barrel.
fr: Sélectionnez les plugins que vous voulez activer pour ce tonneau.

source: You can select the plugins you want to enable or disable globally, that is the plugins that can be used in the different barrels. Please note that for a plugin to be accessible from a barrel, you will need to activate that plugin for the barrel. To do this, from the <i>List of sites</i> click on 'plugins' next to the barrel of your choice.
fr: Sélectionnez les plugins que vous souhaitez activer ou désactiver de façon globale, c'est à dire que vous définissez la liste de plugins qui peuvent être utilisés dans les différents tonneaux. Veuillez noter que pour qu'un plugin soit accessible depuis un tonneau, il vous faudra activer ce plugin pour le tonneau. Pour ce faire, depuis la <i>List des sites</i>, cliquez sur 'plugins' à côté du tonneau de votre choix.

source: Word document import
fr: Import d'un document Word

source: File operations
fr: Opérations sur les fichiers

source: Create an empty file
fr: Créer un fichier vide

source: Copy or move a file
fr: Copier ou déplacer un fichier

source: Create
fr: Créer

source: to
fr: vers

source: read
fr: lecture

source: write
fr: écriture

source: Creating empty file
fr: Création d'un fichier vide

source: The specified file already exists!
fr: Le fichier spécifié existe déjà!

source: home
fr: accueil

source: Copy
fr: Copier

source: Move
fr: Déplacer

source: parent page
fr: page parent

source: You can access your barrel's files using WebDAV by pointing your WebDAV client to the following address.
fr: Vous pouvez accéder aux fichiers de votre site par WebDAV en vous rendant à l'adresse suivante.

source: Page plugins
fr: Plugins de la page

source: Available plugins
fr: Plugins disponibles

source: Not deleting page, it has child pages!
fr: Impossible de supprimer la page, elle comporte des sous-pages.

source: rename
fr: renommer

source: parameters
fr: paramètres

source: barrel options
fr: options du tonneau

source: barrel plugins
fr: plugins du tonneau

source: page removed
fr: page supprimée

source: page plugins
fr: plugins de la page

source: file deleted
fr: page supprimée

source: In order to access your barrel's files using WebDAV, please ask your Diogenes administrator to enable this feature in the Diogenes configuration file.
fr: Pour accéder aux fichiers de votre tonneau grâce à WebDAV, veuillez demander à votre administrateur de Diogenes d'activer cette fonctionalité dans la configuration de Diogenes.

source: Deleting page
fr: Suppression du fichier

source: add a page
fr: ajouter une page

source: Creating new page
fr: Création d'une nouvelle page

source: no barrels available
fr: pas de tonneaux disponibles

source: Warning : in order to make use of virtual hosts or WebDAV, you need to set $globals->rooturl to a full URL starting with http:// or https:// in your Diogenes configuration file.
fr: Attention : pour utiliser les fonctionalités de serveurs virtuels ou de WebDAV, $globals->rooturl doit être une URL complete commen_ant par http:// ou https:// dans votre fichier de configuration de Diogenes.
