Repository: Polytechnique-org/diogenes
Catalog: debian/po/*.po
Languages: es, fr, sv

source: Welcome to the Diogenes setup program
es: Bienvenido al programa de instalación de Diogenes
fr: Bienvenue dans le programme de paramétrage de diogenes
sv: Välkommen till konfigurationen av Diogenes

source: You must have a database server already setup and ready to go if you are going to have this program configure your database for you. If you are not comfortable with this, you should tell the debconf process that you do not have any database server. You will then need to configure Diogenes manually.
es: Debe tener un servidor de base de datos configurado y funcionando si desea que este programa configure su base de datos por Ud. Si no está de acuerdo debe decirle a debconf que no tiene ningun servidor de base de datos. Tendrá entonces que configurar Diogenes manualmente.
fr: Vous devez déjà avoir un serveur de bases de données paramétré et prêt si vous souhaitez que ce programme configure la base de données pour vous. Si cela ne vous convient pas, vous devriez indiquer au processus debconf que vous n'avez pas de serveur de bases de données. Vous devrez ensuite configurer diogenes vous-même.
sv: Du måste ha en databasserver konfigurerad och klar att köras om du ska låta detta program konfigurera din databas åt dig. Om du inte känner dig komfortabel med detta bör du instruera debconf att du inte har någon databasservern. Du kommer då att behöva konfigurera Diogenes manuellt.

source: If debconf is set up in a way that you will not be asked questions interactively (i.e. you do not see this note during installation but as a mail to your root account), Diogenes will assume that your web server is apache and your database server is MySQL and no MySQL root password is set. If any of these do not apply, Diogenes will not run unless you configure it manually by creating its database and editing the files in /etc/diogenes.
es: Si debconf está configurado en una forma en la que Ud. no responde a sus preguntas interactivamente (ej. no ve esta nota durante la instalación, la ve en un correo electrónico en la cuenta de root), Diogenes asumirá que su servidor web es Apache, que su servidor de base de datos es MySQL y que noy hay contraseña de root en MySQL. Si alguna de estas condiciones no se cumple, Diogenes no funcionará hasta que sea configurado manualmente creando su base de datos y modificando los archivos en /etc/diogenes.
fr: Si debconf est paramétré pour ne pas vous poser de questions de façon interactive (c'est-à-dire que vous ne voyez pas cette note pendant l'installation mais dans un courriel adressé au super-utilisateur), diogenes supposera que votre serveur web est apache, que votre serveur de bases de données est MySQL et qu'il n'y a pas de mot de passe pour l'administrateur de MySQL. Si l'une de ces conditions ne s'applique pas, diogenes ne fonctionnera pas tant que vous ne l'aurez pas configuré vous-même en créant sa base de données et en modifiant les fichiers dans /etc/diogenes.
sv: Om debconf är inställd så att du inte kommer att bli frågad frågor interaktivt (alltså att du inte ser denna notering under installation men som ett e-postmeddelande till ditt root-konto) antar Diogenes att din webbserver är apache och din databasserver är MySQL och inget lösenord för MySQL-användaren root är satt. Om någon av dessa inte stämmer kommer Diogenes inte att kunna köras om du inte konfigurerar den manuellt genom att skapa dess databas och redigera filerna i /etc/diogenes.

source: Remove web site data after "purging" the diogenes package?
es: ¿Eliminar la información de los sitios web después de "purgar" el paquete diogenes?
fr: Supprimer les données du site lors de la purge du paquet ?
sv: Ta bort webbdata efter "rensning" av diogenes-paketet?

source: Should the data that makes up Diogenes's web sites be removed when the diogenes packages is purged with the "dpkg --purge diogenes" command (i.e. remove everything including the configuration)?
es: ¿La información de los sitios web de Diogenes deberá ser eliminada cuando el paquete diogenes es purgado con el comando "dpkg --purge diogenes" (ej. eliminar todo incluída la configuración)?
fr: Veuillez choisir si vous souhaitez supprimer les données créées pour les sites de diogenes lors de la purge du paquet par la commande « dpkg --purge diogenes » (c'est-à-dire tout supprimer y compris la configuration).
sv: Ska data som är innehållet i Diogenes webbplatser tas bort när diogenes-paketet rensas med kommandot "dpkg --purge diogenes" (alltså, ta bort allt inklusive konfigurationen)?

source: Type of web server:
es: Tipo del servidor web:
fr: Type de serveur web :
sv: Typ av webbserver:

source: By default Diogenes supports any web server that php4 does. This config process currently only supports Apache directly. If you use another one you will have to handle the web ends manually. If you choose the first option, this install process will manage the configuration (or attempt to) of the Apache specific portions necessary to run Diogenes properly.
fr: Par défaut, diogenes gère les mêmes serveurs web que PHP4. Le processus de configuration actuel ne supporte directement qu'apache. Si vous en utilisez un autre, vous devrez vous occuper de la partie web vous-même. Si vous choisissez la première option, le processus d'installation gérera (ou essayera de gérer) la configuration des parties d'apache spécifiques nécessaires au fonctionnement correct de diogenes.
sv: Som standard stöder Diogenes alla webbserver som php4 gör. Denna konfigurationsprocess har för närvarande endast stöd för Apache. Om du använder en annan måste du hantera detta manuellt. Om du väljer första valet kommer denna installationsprocess att hantera konfigurationen (eller försök att) av specifika delar av Apache för att köra Diogenes på ett korrekt sätt.

source: User your web server runs as:
es: Usuario bajo el que su servidor web es ejecutado:
fr: Identifiant utilisé par le serveur web :
sv: Användare som din webbserver körs som:

source: Unable to obtain the user your web server runs as. This is needed in order to allow the web server to write the files that make up the Diogenes-managed web sites.
es: Imposible obtener el usuario bajo el que su servidor web es ejecutado. Esto es necesario para permitirle escribir los archivos de los sitios manejados por Diogenes.
fr: Il s'est avéré impossible d'obtenir l'identifiant qu'utilise le serveur web pour fonctionner. Cet identifiant est nécessaire pour permettre au serveur web de gérer les fichiers qui composent les sites gérés par diogenes.
sv: Kunde inte fastställa vilken användare som din webbserver körs som. Detta behöver för att tillåta webbservern att skriva filer för Diogenes-hanterade webbplatser.

source: Group your web server runs as:
es: Grupo bajo el que su servidor web es ejecutado:
fr: Groupe utilisé par le serveur web :
sv: Grupp som din webbserver körs som:

source: Unable to obtain the group your web server runs as. This is needed in order to allow the web server to read Diogenes's configuration files.
es: Imposible obtener el grupo bajo el que su servidor web es ejecutado. Esto es necesario para permitirle escribir los archivos de los sitios manejados por Diogenes.
fr: Il s'est avéré impossible d'obtenir le groupe utilisé par le serveur web pour fonctionner. Ce groupe est nécessaire pour permettre au serveur web de lire les fichiers de configuration de diogenes.
sv: Kunde inte fastställa vilken grupp som din webbserver körs som. Detta behöver för att tillåta webbservern att läsa konfigurationsfiler för Diogenes.

source: Automatic, Manual
es: Automático, Manual
fr: Automatique, Manuelle
sv: Automatisk, Manuell

source: Type of database installation:
es: Tipo de la instalación de la base de datos:
fr: Type d'installation de la base de données :
sv: Typ av databasinstallation:

source: If you want the setup program to ask you questions and do the database setup for you, select "Automatic". (Recommended)
es: Si quiere que este programa le consule y configure la base de datos por Ud. seleccione "Automático". (Recomendado)
fr: Si vous souhaitez que le programme de paramétrage vous pose des questions et paramètre la base de données pour vous, veuillez choisir « Automatique » (option recommandée).
sv: Om du vill att konfigurationsprogrammet ska fråga dig frågor och göra databasinställningar åt dig, välj "Automatisk". (Rekommenderas)

source: If you want to configure your database by hand, select "Manual". In this case you will have to create the Diogenes database and user by hand and handle database upgrades manually.
es: Si quiere configurar su base de datos manualmente seleccione "Manual". En este caso tendrá que crear el usuario y la base de datos de Diogenes a mano, y manejar las actualizaciones de la base de datos de igual manera.
fr: Si vous souhaitez configurer la base de données vous-même, veuillez choisir « Manuelle ». Dans ce cas vous devrez créer l'utilisateur et la base de données de diogenes et vous occuper des mises à jour de la base de données vous-même.
sv: Om du vill konfigurera din databas på egen hand, välj "Manuell". I detta fall måste du skapa Diogenes databas och användare på egen hand och hantera databasuppgraderingar manuellt.

source: Database admin password:
es: Contraseña del administrador de la base datos:
fr: Mot de passe de l'administrateur du serveur de bases de données :
sv: Databasadministratörens lösenord:

source: Enter the password for your database admin user to access the database. This password had been set when installing your database. It is most likely NOT the same password that your Diogenes manager account will use.
es: Ingrese la contraseña del usuario administrador de la base de datos. Esta contraseña fue puesta cuando instaló la base de datos. Se recomienda que NO sea la misma que la del usuario administrador de Diogenes.
fr: Veuillez indiquer le mot de passe de l'administrateur de votre serveur de bases de données. Ce mot de passe a été établi lors de l'installation de votre serveur de bases de données. Il y a de fortes chances qu'il ne soit PAS le même que celui utilisé pour le compte du gestionnaire de diogenes.
sv: Ange lösenord för din administratörsanvändare i databasen för att tillgå databasen. Detta lösenord har satts när du installerade din databas. Det är antagligen INTE samma lösenord som ditt administratörskonto i Diogenes använder.

source: Hostname of the database server:
es: Nombre del servidor de base de datos:
fr: Nom d'hôte du serveur de bases de données :
sv: Värdnamn för databasserver:

source: If your database is on another machine besides the one that Diogenes is running on then you need to change this value to the fully qualified domain name for that system.
es: Si su base de datos se encuentra en otra maquina distinta a la que Diogenes se está ejecutando debe cambiar este valor a un nombre de dominio válido para su sistema.
fr: Si votre serveur de bases de données est sur une machine autre que celle où fonctionne diogenes, vous devez modifier cette valeur et indiquer le nom de domaine complètement qualifié de ce système.
sv: Om din databas finns på en annan maskin förutom den som Diogenes körs på behöver du ändra detta värde till det fullt kvalificerade domännamnet för det systemet.

source: Name for the Diogenes database:
es: Nombre para la base de datos de Diogenes:
fr: Nom de la base de données de diogenes :
sv: Namn på Diogenes databas:

source: By default this will be "diogenes". This is where all the Diogenes related database items will be setup and stored.
es: Por omisión será "diogenes". Esto es donde Diogenes configurará y guardará todos los elementos relacionados con su base datos.
fr: Par défaut, il s'agit de « diogenes ». C'est l'endroit où tous les objets de base de données liés à diogenes sont paramétrés et conservés.
sv: Som standard kommer detta vara "diogenes". Det är där alla Diogenes-relaterade databasposter kommer att ställas in och lagras.

source: Database username:
es: Usuario de la base de datos:
fr: Propriétaire de la base de données :
sv: Användarnamn för databas:

source: What username will access the database for Diogenes? By default this is it's own user "diogenes" so that permissions can be tightened down.
es: ¿Cual usuario accederá a la base de datos de Diogenes? Por omisión es su propio usuario "diogenes", asi los permisos pueden ser reforzados.
fr: Veuillez indiquer l'identifiant qu'utilisera diogenes pour accéder à la base de données pour diogenes. Par défaut, il s'agit de l'utilisateur « diogenes » lui-même, ce qui permet de restreindre les permissions.
sv: Vilken användarnamn ska användas för att tillgå Diogenes databas? Som standard är detta dess egna användare "diogenes" så att rättigheterna kan minskas ner till ett minimum.

source: Password for the Diogenes user:
es: Contraseña para el usuario Diogenes:
fr: Mot de passe du propriétaire de la base de données :
sv: Lösenord för Diogenes användare:

source: Enter a password for the database user which will be used along with the database user name you have already supplied to connect to the database.
es: Ingrese una contraseña para el usuario de la base de datos anteriormente mencionado.
fr: Veuillez indiquer un mot de passe pour le propriétaire de la base de données.Il s'agit du mot de passe qui sera utilisé avec l'identifiant du propriétaire pour se connecter à la base de données.
sv: Ange ett lösenord för databasanvändaren som ska användas tillsammans med användarnamnet för databasen du redan angivit för att ansluta till databasen.

source: If you wish to leave the password empty, type "none". If you wish to use an automatically generated random password type "auto".
es: Si desea dejar la contraseña vacía ingrese "none". Si desea que se genere de forma aleatoria ingrese "auto".
fr: Si vous souhaitez ne pas utiliser de mot de passe, veuillez indiquer « none », aucun. Si vous souhaitez utiliser un mot de passe généré de manière aléatoire, veuillez indiquer « auto ».
sv: Om du önskar lämna lösenordet blankt, ange "none". Om du önskar att automatiskt generera ett slumpmässigt lösenord, ange "auto".

source: MySQL administrator username:
es: Usuario administrador de MySQL:
fr: Nom de l'administrateur de MySQL :
sv: Användarnamn för MySQL-administratören:
